docs/posts/2019-08-06-some-thoughts-on-mass-shootings.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 23, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Some Thoughts on Mass Shootings</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Some Thoughts on Mass Shootings</h1>
<p class="subtitle" role="doc-subtitle">Aug 06, 2019</p>
</header><section id="outline-container-org45e18ac" class="outline-2">
<h2 id="org45e18ac">The Second Amendment</h2>
<div class="outline-text-2" id="text-org45e18ac">
<p>
Despite the Supreme Court’s 2008 Heller <a href="https://www.oyez.org/cases/2007/07-290">decision</a>, I have never thought that a reasonable reading of the 2nd Amendment guaranteed an individual’s unequivocal right to possess firearms. In fact, the only Supreme Court decision that focused on the 2nd Amendment, <a href="https://www.oyez.org/cases/1900-1940/307us174">US vs. Miller</a> in 1939, found that there is no individual right to bear arms independent of the nation’s self-defense interests. There is also reason to believe that Madison wrote the 2nd Amendment to protect the rights of southern states to have militias that they could use to put down slave revolts.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<p>
I do believe, however, that every person has an inherent right to self-defense.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>  I take this to not be a civil right enshrined in law, but as a basic human right. Although there are weapons that are designed to be used for defensive roles, assault rifles, by definition, are not. I have no sympathy for those who argue that their guns are necessary for defense against a tyrannical government. I have seen four <a href="https://www.youtube.com/watch?v=bGrNkl8HzPw&amp;app=desktop">Apache helicopters</a> on an attack run at a range in Fort Hood. If you think that your AR-15 will defend you, you’ve been watching too many bad action movies.<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>
</p>
</div>
</section>
<section id="outline-container-org82ba3c2" class="outline-2">
<h2 id="org82ba3c2">Good Guys with Guns</h2>
<div class="outline-text-2" id="text-org82ba3c2">
<p>
Lately, there have been demands to arm teachers to prevent school shootings. This is a variation on the idea that the only solution to gun violence is more good guys with guns. There are obvious reasons why this is untenable. We had problems with active shooters when I was in Afghanistan. The solution was not to have more people carrying guns, since everyone except me and the other two chaplains were already armed. The solution was to have a soldier standing at the ready at every meeting, doing nothing but looking for signs of hostility, prepared to shoot as soon as a weapon was drawn. That&rsquo;s what the only &ldquo;more guns&rdquo; solution looks like – an armed guard standing with weapon drawn in every classroom, in every corridor of the mall, covering every line of sight in every public venue, etc.<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>  That&rsquo;s not a country where I want to live.
</p>
</div>
</section>
<section id="outline-container-org1400d98" class="outline-2">
<h2 id="org1400d98">Possible Solutions</h2>
<div class="outline-text-2" id="text-org1400d98">
<p>
Mass shootings are a complex problem, but not irreducibly complex. We shouldn’t pretend that our only options are an impossible perfect solution and doing nothing. So, what should be done? There are some means that, I believe, would help reduce the level of gun violence.
</p>

<ol class="org-ol">
<li>Treating sources of terrorism consistently would be a good first step. White nationalism has always been an ideology associated with terrorism, from the lynchings of Reconstruction to the mass shooting in El Paso. As a terrorist ideology, white nationalist demands for racial purity are no different than demands for religious purity from other movements that we rightly label as terrorists.</li>
<li>Ban assault weapons &#x2014; that has already been shown to be effective.</li>
<li>Ban high capacity magazines. Otherwise, thirty people are dead before the “good guy with a gun” has an opportunity to respond.</li>
</ol>

<p>
May God forgive me, if I ever demand my rights at the possible expense of another human being’s life.
</p>
</div>
</section>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Conservatives had no problem with gun control when the Black Panthers were taking up arms to press for equal civil rights. As Governor of California, Ronald Reagan signed an act in 1967 banning the carrying by members of the public of loaded firearms in cities. He <a href="https://books.google.com/books?id=5PRABAAAQBAJ&amp;pg=PT73&amp;lpg=PT73&amp;dq=%E2%80%9Cwould+work+no+hardship+on+the+honest+citizen.%E2%80%9D+reagan&amp;source=bl&amp;ots=cq6Kl3wRXB&amp;sig=AaCua1410lGebtc18y0CD85uRok&amp;hl=en&amp;sa=X&amp;ved=0ahUKEwjvivOHxNfWAhUn4IMKHYaDAuYQ6AEINzAD#v=onepage&amp;q=%E2%80%9Cwould%20work%20no%20hardship%20on%20the%20honest%20citizen.%E2%80%9D%20reagan&amp;f=false">said</a> there is “no reason why on the street today a citizen should be carrying loaded weapons.” It&rsquo;s also curious how reticent the NRA is to come to the defense of registered African-American gun owners.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Specifying this right will, by no means, be simple. I do not believe that people have the right to do <i>anything</i> that will result in saving their lives. I also do not believe that the right to self-defense is automatically a right to kill, if there are other effective means available. There are also tricky questions about prisoners on death row, etc. This is also a right that implies certain duties, like the duty to ensure, as much as possible, that no innocent people are harmed. This means that gun-owners have a duty to acquire and maintain a high level of skill. This could mean that the public has a right to demand that those who wish to carry firearms in public be tested and certified. 
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I’ve also recently heard that when criminals get semi-automatic weapons, then citizens need full-auto. In my infantry days, the only situation in which fully automatic fire was used was to spray a room with bullets before entering. So, saying this is the same as saying “When criminals get semi-auto, then citizens kill indiscriminately.”
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
That doesn’t mean that a member of the public with a gun will not occasionally act to prevent, or minimize, some tragedy. That will have to be weighed against members of the public misidentifying a target or harm done by negligent discharges, a particular problem that we had in Iraq.
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 23, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
